{
    "PROJECTS": {
        "AIA049 Knowledge Hub Chatbot": {
            "PROPOSAL": "Knowledge Hub Chatbot\n\nPROJECT TITLE\tKnowledge Hub Chatbot\nCOMPANY NAME\tCapital Legal\nCLIENT\tBarry Pound\nPROJECT MANAGER\tSean Oldenburger\nAUTHOR\tSamuel Cunningham\nSTART DATE\tTBD\nEND DATE\tTBD\nPROJECT DESCRIPTION\tCreating an AI chatbot powered by large language models, capable of answering questions and retrieving information from a knowledge base of legal/conveyance documents.\n\n1.0 Scope\nThis will be a beta project of the Knowledge Hub chatbot.\nThe chatbot will be available through a standalone website, developed and hosted by AI Advancements.\nThe chatbot will be able to answer questions and retrieve specific information when asked by the user. The chatbot should always reference the document from which the answer was found.\nThe beta will NOT include authentication or analytics.\n\n2.0 Contract Structure\nThe contract type of this project is a fixed fee cost.\nThe payment of this project is to be paid per completion of the project. AIA will invoice the amount when both parties can agree the key deliverables outlined in Section 3.0 have been met.\nHandover of code will be done upon AIA receiving full payment.\nCapital Legal will retain all intellectual property associated with this project, including any code, data or other resources generated.\n\n3.0 Key Deliverables\nThe project will be considered complete upon completion of the following key deliverables:\n• The chatbot should be available on a public website.\n• The user should have to approve an AI use disclaimer before being able to access the chatbot as well as at the end of the session.\n• The chatbot should be able to dynamically answer user's questions using a large language model (AI).\n• The chatbot should be able to answer queries based on the documents in its knowledge base.\n• The chatbot should reference one or more documents with every answer.\n• Users should be able to copy the AI's response with a single click.\n\nUpon completion of the project:\n• AI Advancements will be responsible for ensuring the beta website is available and functional to all users for a period of 2 months.\n\n4.0 Technical Architecture\nAI Advancements will host all necessary services for this application:\n• Website – The chatbot is available on a public website, hosted by AI Advancements. Users will have to approve an AI use disclaimer before being able to enter queries. Users should be able to copy the AI response with a single click.\n• Server – The chatbot server is hosted on Microsoft Azure and connected to the website. All AI logic will be stored and run in the server using Microsoft AI models.\n• Vector Database – The chatbot's knowledge base has been embedded and stored in a vector database for retrieval by the chatbot.\n\n5.0 Assumptions:\n• All documents are publicly available and do not require additional security measures.\n• Documents for the knowledge base will be provided by Capital Legal. This is limited to: PDF, DOCX, PPT, CSV, TXT, Websites and HTML files. AI disclaimer will be provided by Capital Legal.\n• AI Advancements will be responsible for any operating costs during development and the 2-month beta period.\n\n6.0 Timeline\nMilestone\tDescription\tEstimated Time (days)\n1\tCreation of knowledge base\t1\n2\tAI logic (server development and hosting)\t2.5\n3\tWebsite development and hosting\t1\n\tTotal\t4.5\n\n7.0 Budget\nCategory\tTime (Days)\tDay Rate\tCost ($)\nDeveloper Effort\t4.5\t1,600\t7,200\n\tTotal Costing ($)\t7,200\n\t+ 10% GST\t$7,920\n\n8.0 Future Work\nPhase 2 (Post beta)\nAssuming the beta is successful, the following is a rough plan for rolling the project out to production:\n• Add authentication for users: login with email/password, Two Factor Authentication etc.\n• Add analytics to track user activity and record conversation history.\n• Add the ability for approved users to add/remove files from the knowledge base.\n• Integration with Capital Legal servers.\nEstimated Cost: 15 - 30k\n\nPhase 3\nWhen this Knowledge Hub chatbot is finalised and tested for LJ Hooker Settlements we can quite easily move it across and make it work for all other companies.\nWe estimate it will take 0.5-1 days to install and deploy the Knowledge Hub for each branch.\nEstimated Cost: 4 - 8k\n\n9.0 AI Advancements Background\nAI Advancements (AIA) is a Perth-based AI consultancy established in July 2023. As one of Perth's leading AI consultancies, we specialise in applying large language models and computer vision to address business challenges and automate workflows.\n\nOur expertise extends to collaborating with numerous Perth businesses, where we have developed bespoke AI software solutions that enhance operational efficiency, reduce costs, and elevate the quality of their offerings. Our proficiency in creating large language model-based systems, such as the Knowledge Hub Chatbot for this project, is well-documented.\n\nFor reference, please see the below examples of related projects we have successfully executed.\nFor further information about AI Advancements, previous projects and case studies refer to our Company Portfolio or our website: AI Advancements\n\nPrevious Projects:\n1. AI Educational Tutors\nClient: Coursebox AI\nDescription: We created a personalised AI tutor powered by secure language models and an agent system to guide students with real-time, course-specific assistance. Instructors can customise the AI's responses by uploading documents and websites, ensuring the tutor aligns with course objectives and enhances student engagement and support throughout the learning experience.\nAI Advancements did a fantastic job at implementing AI chatbot tutors in our online training course software. Our customers are always looking for innovative ways to engage their learners, and that is exactly what they get with this amazing tech. - Alex Hey, CMO of Coursebox\n\n2. Automated Reporting\nClient: WADSIH (WA Data Science and Innovation Hub)\nDescription: We developed a real-time workshop reporting tool, using large language models (LLMs) to instantly process participant inputs from live google documents, identify key themes, and display live insights on-screen. This tool auto-generates summary reports and presentations, giving attendees an immediate, cohesive view of all ideas discussed. This project spun out a SAAS tool called Edison Collab which utilises very similar technologies to this project in building a knowledge hub of information - Edison Collab\n\n3. Health Hackathons\nClient: WA Health Department\nDescription: We have participated in and won 2 WA Health hackathons by building them chatbots on top of a knowledge base of provided users medical data as well as a live AI generated avatar being able to talk to in real time about your medical data in simple terms."
        },
        "AIA048 Medivox MVP": {
            "PROPOSAL": "Medivox MVP\n\nPROJECT TITLE\tMedivox MVP\nCOMPANY NAME\tSupanova Health Pty Ltd\nCLIENT\tDr Francesco De Toni\nPROJECT MANAGER\tSean Oldenburger\nAUTHOR\tSean Oldenburger\nSTART DATE\t03/03/2025\nEND DATE\t31/03/2025 (expected)\nPROJECT DESCRIPTION\tA mobile-friendly web application for two directional speech-to-speech communication between a doctor and patient translating from English to Mandarin or Italian.\n\n1.0 Scope\nThis project is the MVP for the Medivox application to be able to showcase to investors and potential customers the vision of the product.\nThis MVP will build the foundations of the Medivox application with a push to talk button to communicate between 2 phones with translation from English to Mandarin and English to Italian using both GPT enabled translating and a template matching algorithm.\n\n2.0 Contract Structure\nThe contract type of this project is a fixed fee cost. There is a fixed cost for the entire proposal which has been broken down into its respective components or objectives as seen in Section 6.\nThe payment of this project is to be paid per completion of the project. AIA will invoice the amount when both parties can agree the deliverables have been met.\nHandover of code will be done upon AIA receiving payment of all milestones and both parties agree all deliverables of the project are met.\nThe intellectual property (IP) developed during this project will remain with the client, ensuring full ownership and control over the Medivox application. To maintain the highest level of security and privacy, any subcontractors engaged in this project or future projects will be required to sign a Non-Disclosure Agreement (NDA) prior to commencing any work. This measure is to guarantee that subcontractors adhere to the same confidentiality standards as the primary contracting parties.\nFor more information and terms and conditions please refer to the Contractors Agreement document.\n\n3.0 Key Deliverables\n• A mobile-friendly website for the Medivox application featuring a basic speech-to-speech interface.\n• Two-directional translation engine (doctor to patient and vice versa) for English to Mandarin and Italian.\n\n4.0 Plan\nWebsite Interface:\n• We will create a basic user interface that you can open on 2 phones and enter as either a doctor or patient.\n• The doctor's screen:\n  o Button to record audio.\n  o Progress shown for translating audio, converting to speech, and playing to the patient. The record audio button will be disabled during the processing time.\n  o Show the translated result that went to the patient, including where template matching was used.\n• The patient's screen:\n  o Select their language (only Italian and Mandarin options available for this MVP).\n  o Will show when the doctor is speaking.\n  o Show when the audio is being processed (translated).\n  o Play the audio when the processing is complete.\n  o Also shows the translated text on the screen.\n• The interface will include provided Medivox branding.\n• The interface will be coded using React.js\n\nAI Backend Logic:\n• We will use Azure as the cloud provider to host all models, data and code to create a secure application where data privacy comes first which is crucial in any healthcare environment.\n\n5.0 Assumptions\n• Medivox has Azure cloud service set up and AI Advancements has access.\n• Medivox has their domain supanova.health set up and AI Advancements has access.\n• Medivox will provide all templates with matching translations, AI Advancements can place it into the required database on Azure.\n\n6.0 Timeline\nMilestone\tDescription\tEstimated Time (days)\n1\tWebsite Interface\t1\n2\tAI Backend Logic\t3.5\n3\tHosting\t1\n\tTotal\t5.5\n\nThe work completed will be spread across a maximum of 1 month. Any delays that are outside of AI Advancements scope as outlined in Section 5 Assumptions can cause delays to this timeline.\n\n7.0 Budget\nCategory\tTime (Days)\tDay Rate\tCost ($)\nDeveloper Effort\t5.5\t1,272.73\t7,000\n\tTotal Costing ($)\t7,000\n\t+ 10% GST\t7,700\n\nWe have applied a one-time discount to help you stay as close to your $7k budget for your MVP. We want to support your growth and help you quickly validate your idea.\n\n8.0 Future\nMoving forward the next potential steps would be:\n• Enable 2-way communication between doctor and patient.\n• Speed up the translation processing to get closer to a real time conversation between doctor and patient.\n• Improve the front-end UI as well as move to a production version with security, login, historical data saving, etc.\n• Scale up the template translation database for both the selected languages and to add more languages – including improving the backend logic to handle more languages."
        },
        "AI Article Automation": {
            "DESCRIPTION": "AI Article Automation\n\nPROJECT TITLE\tAI Article Automation\nCOMPANY NAME\tCurtin University\nCLIENT\tMilo Braham\nPROJECT MANAGER\tSean Oldenburger\nAUTHOR\tSean Oldenburger\nSTART DATE\tTBC\nEND DATE\tTBC\nPROJECT DESCRIPTION\tAn automated tool to summarise Curtin research papers and turn them into news articles.\n\n1.0 Scope\nThis project aims to support Curtin University's Tier 1 research group, CFIGS, in showcasing its academic outputs to the public and industry by developing a semi-automated pipeline for the discovery, summarisation, and publication of research content.\nThe system will:\n• Input a folder of downloaded CFIGS-related research papers from Curtin's internal research repositories.\n• Utilise AI to summarise key details of each publication and create a news article based on the paper in your tone of voice.\n• Generate AI images relevant to the publication.\n• Simple interface/script to easily run the system.\n• Support human-in-the-loop workflows (Graydon's role) to review, edit, and approve content.\n\n2.0 Contract Structure\nThe contract type of this project is a fixed fee cost. There is a fixed cost for the entire proposal which has been broken down into 2 phases as seen in Section 6.\nThe payment of this project is to be paid per completion of each phase. AIA will invoice the amount when both parties can agree the deliverables have been met. Invoices are due within 14 days of being issued.\nHandover of code will be done upon AIA receiving payment of all milestones and both parties agree all deliverables of the project are met.\nCurtin's IP maintains their IP, including all data, documentation and processes. Likewise, IP created by AI Advancements stays with AI Advancements.\nAI Advancements core team is responsible and in charge of all work completed and will ensure everything completed is up to their standards. AI Advancements retains the right to subcontract or hire for parts of the project if required.\n\n3.0 Key Deliverables\n• AI summarisation and article generator that rewrites papers into industry-facing news articles in your tone of voice.\n• Image generation tool that creates relevant images for the publication.\n• Simple local system that can run the script for scraping and creating the article on a Curtin computer.\n\n4.0 Plan\n• AI Summarisation & Article Generation\nUse Microsoft Azure OpenAI (enterprise-secure) to:\n  o Summarise the key points of each research paper,\n  o Rewrite them into professional, web-ready news articles using your preferred tone of voice.\n• Image Generation\nUse the new OpenAI image generator to create relevant images for the news article.\n• Azure Setup\nWe will help set up an Azure account for your team. This allows your team to continue generating article content at any time with no dependency on AI Advancements.\n• Simple Local System\nDeliver a complete local system that can:\n  o Run the scraper to fetch new papers.\n  o Process each paper with the Azure-hosted AI model.\n  o Output news articles ready for review, editing, and manual publishing.\nThe system will be designed to run on a Curtin-managed desktop or laptop with minimal setup and no exposure of sensitive credentials.\n\n5.0 Assumptions\n• Curtin will provide a minimum of 10 example publications for the duration of creating and testing the system.\n• Curtin will provide at minimum 10 examples of content to guide the tone of voice for the AI-generated articles.\n• Curtin will assist in setting up the Azure account where it is necessary, including permission.\n• Final article review and publishing will be done manually by Curtin staff (the AI algorithm is not responsible for any incorrect or false information published).\n\n6.0 Timeline\nMilestone\tDescription\tEstimated Time (days)\n1\tDevelopment\t3.5\n\tTotal\t3.5\n\nThe work completed will span over a maximum period of 1 month, with the goal of completing it as soon as possible.\nThis contract is valid for 30 days.\n\n7.0 Budget\nCategory\tTime (Days)\tDay Rate\tCost ($)\nDeveloper Effort\t3.5\t1,600\t5,600\n\tTotal Costing ($)\t5,600\n\t+ 10% GST\t6,160"
        },
        "AIA70 SmartBroker PDF Extractor": {
            "PROPOSAL": "SmartBroker PDF Extractor\n\nPROJECT TITLE\tSmartBroker PDF Extractor\nCOMPANY NAME\tGrange Insurance\nCLIENT\tJono Ross\nPROJECT MANAGER\tSean Oldenburger\nAUTHOR\tSean Oldenburger\nSTART DATE\tTBC\nEND DATE\tTBC\nPROJECT DESCRIPTION\tA secure web-based platform that converts insurer PDFs into structured Word tables, streamlining broker workflows and eliminating manual data entry.\n\n1.0 Scope\nMany insurance brokerages across Australia face the same manual challenge: extracting structured data from insurer-generated PDF documents. This is a time-consuming and error-prone process, particularly when the data needs to be entered into broker software that doesn't integrate directly with insurer systems.\nThis proposal outlines a scalable solution that automates the extraction of information from insurer PDFs into an editable table format in Word. This process will dramatically reduce manual input time, eliminate human error, and increase overall efficiency for insurance brokerages.\n\nValue\nRight now, the task of manually extracting PDF data and entering it into internal systems takes:\n• ~30 minutes per document (5-10min)\n• ~100 documents processed daily\n• ~$50/hour per employee effort\nAt 240 working days per year this comes to approximately $600,000 of manual processing cost annually - excluding the hidden cost of human error, rework, and reduced capacity for higher-value work.\n\n2.0 Key Deliverables\n• Website interface to upload documents and receive the data on both the website and a downloaded word document.\n• Extract the necessary information from the uploaded PDFs and output a consistent format suitable for quick copying into internal broker systems with an accuracy of 95%+ based on a provided/determined test set.\n• Error reduction, especially when compared to manual copy-paste from PDF\n• Timesaving of 50%+ per report\n• Full compliance with data retention requirements - no information stored, all data erased after processing\n\n3.0 Plan\nFrontend (Website):\n• Clean, user-friendly interface\n• Drag-and-drop or click-to-upload PDF\n• Visual preview of uploaded document\n• Page selection UI (choose which pages to include/extract information from)\n• Display preview of extracted information table\n• Export table to Word (with styling options such as font and font size)\n• Username and password protected login\n\nBackend:\n• AI system to extract out relevant and correct information from the uploaded PDFs with an accuracy of 95%+\n  o This accuracy will be confirmed with a testing set of 20+ example documents\n• PDF parsing logic\n  o OCR fallback (if scanned documents are confirmed to be in use)\n• Secure file handling with instant erasure post-processing\n• Word table generation logic with user-defined styles\n\nHosting:\n• Frontend hosted on AI Advancement Vercel account\n• Backend hosted on AI Advancement Azure environment\n• AI deployment using AI Advancement secure Azure LLM (no data is sent to third party applications or used for training, etc.)\n• No data (uploaded PDFs) will be stored and will be instantly removed post processing\n\n4.0 Assumptions\n• The client will confirm whether scanned PDFs are present (so we can include OCR if needed)\n• The client will provide example PDFs and expected output format\n  o There needs to be a minimum of 20 PDFs with the ideal outcome for testing the system along with a minimum of 20 PDFs for helping tailor the AI system (the more data the better)\n• The client will provide feedback on the full system development from the frontend functionality to the AI extracted output and presentation of the data\n\n5.0 Timeline\nThis project will be an ongoing project and commitment from both parties and completed in the shortest timeframe possible with a maximum timeline of 4 months.\nThis timeline can be extended due to unforeseen circumstances or delays from the client, that is external from AI Advancements control.\n\n6.0 Value-Based Pricing & Partnership Model\nWe estimate that this solution will result in a minimum of 50% time saved per document, equating to at least $300,000 in annual productivity savings across your team, which is a conservative estimate - in reality, improvements in accuracy, ease-of-use, downstream efficiency and higher quality enabled work will likely increase this figure significantly.\n\nTo deliver this value, we propose a value-based licensing model:\n• $100,000 per year licensing fee\n• All-inclusive: this covers development, secure hosting, ongoing maintenance, compliance controls, and feature enhancements. This will ensure a full production quality roll out that can be used securely by your entire team.\n• 3-year minimum term to ensure platform stability and continued improvements\n\nRisk-Free Commitment\nWe are confident in the impact this tool will deliver. As such:\n• You will not be charged the licensing fee until the agreed project deliverables are met\n• If the tool fails to meet the agreed standard, there is no obligation to proceed with the license\n• Once the deliverables are met, the licensing period will begin\n\nShared Growth Opportunity\nAs one of 11 brokerages nationally, your team is uniquely positioned to help shape and champion this platform across the industry. We propose a 50/50 revenue share on any sales of the system to other brokerages:\n• If just two additional brokerages adopt the system, your licensing costs will be fully offset\n• Your team will directly benefit from any expansion without taking on additional effort or risk as we will be responsible for all maintenance and improvements\n• Together, we can scale this from a tactical internal tool into a nationally adopted solution that delivers value industry-wide\n\nWe believe this partnership approach ensures strong alignment - you receive immediate operational value, long-term competitive advantage, and the opportunity to generate ongoing revenue through industry leadership."
        },
        "AIA055 Fortescue Fleet Management Agent": {
            "PROPOSAL": "Fortescue Fleet Management Agent\n\nPROJECT TITLE\tFortescue Fleet Management Agent\nCOMPANY NAME\tFMG Procurement Services Pty Ltd\nCLIENT\tDieter Haage\nPROJECT MANAGER\tSean Oldenburger\nAUTHOR\tSean Oldenburger\nSTART DATE\tTBD\nESTIMATED DURATION\t6 Months\nPROJECT DESCRIPTION\tAI-powered system to optimise autonomous vehicle routing and reduce operational bottlenecks at Fortescue mine sites using Computer Vision and intelligent agents.\n\n1.0 Scope\nFortescue's Integrated Operations Centre, known as Fortescue Hive, manages a sophisticated fleet of autonomous vehicles across complex mining operations. These vehicles are coordinated through the Fleet Management System (FMS), with route planning and oversight carried out by trained personnel referred to as \"builders.\" Due to the dynamic and high-traffic nature of the site, operational inefficiencies regularly emerge. Challenges such as overlapping vehicle paths, close proximity to fixed infrastructure, or route interference can trigger vehicle safety mechanisms, causing unexpected halts or slowdowns. These interruptions impact throughput, create congestion, and reduce overall productivity.\n\nThis project aims to explore how artificial intelligence, specifically Computer Vision (CV) and intelligent agent systems, can be used to automate and optimise how vehicle routes are monitored, adjusted, and managed in real time.\n\nProposed Approach\nThe first stage of the project will be a discovery and validation process, where we collaborate closely with Fortescue to understand current workflows, identify key operational challenges, and evaluate existing data sources and system interfaces. This phase ensures that we target the most impactful problem first and choose the right technical method for your environment.\n\nOur current recommendation is to leverage a combination of custom-trained Computer Vision models and task-specific agentic systems. Rather than relying on off-the-shelf computer-using agents (CUAs), which often underperform in complex or unfamiliar environments, we propose training a Fortescue-specific CV model to accurately detect operational boundaries, infrastructure, vehicle movement patterns, etc. This visual understanding would then guide autonomous agents that interact with the FMS via mouse and keyboard controls, mimicking human actions but with higher consistency and precision, and with safety guardrails in place.\n\nThese agents would be trained on specialised tasks, ensuring better accuracy and maintainability. Over time, a high-level supervisory agent could be introduced to delegate tasks to the appropriate specialised agents, creating a fully automated and adaptive system.\n\nInitial Implementation\nFollowing discovery, we will identify a single high-impact use case, for example, checking and fixing narrow roads that cause trucks to slow down, for development of a Minimum Viable Product (MVP). This MVP will serve as a working proof of concept to demonstrate how CV and agentic systems can solve a targeted operational challenge within Fortescue's environment. It will integrate directly with existing systems and be measurable in terms of productivity or bottleneck reduction.\n\nFuture Roadmap\nOnce the MVP has proven successful, the system can be scaled across additional zones, with new agents or CV pipelines trained to handle the unique characteristics of each environment. Rather than one generalised model, this modular approach allows for accuracy, control, and ongoing optimisation as the system matures.\n\nThis staged and specialised strategy ensures high-impact results early while setting a strong foundation for full operational automation over time.\n\n2.0 Contract Structure\nThis project will be completed on a time and materials basis. This work will be completed and billed at the day rate set out in section 5.\nAny additional hours not outlined in this contract, will require written confirmation from Fortescue before they are completed.\nAI Advancements will invoice Fortescue for the work completed at the end of each month.\nFortescue will retain all intellectual property associated with the project, including but not limited to any code, data and documentation generated during the project.\n\n3.0 Assumptions\n• Fortescue will assist AI Advancements in the onboarding process.\n• AI Advancements will provide weekly updates to showcase the projects progress.\n• Fortescue will assist AI Advancements with any change management/Dev Ops that may be required.\n• Sean Oldenburger will be the lead AI engineer working on this project and work on premise in the Perth office when necessary.\n• Fortescue will cover travel costs if site visits are required.\n• The amount of work to be completed will be decided by Fortescue, limited by the maximum weekly capacity outlined in Section 4.\n\n4.0 Estimated Capacity\nTime Period\tMaximum Weekly Capacity (days)\n1st – 30th April\t2\n1st May – 1st October\t4\n\n5.0 Budget\nCategory\tDay Rate\tCost ($)\nDeveloper Effort\t1,500\t1,500\n\tTotal Costing (+ 10% GST)\t$1,650\n\nOverall Project Costing:\nOverall Cost = $1,500 x 4 days/week x 4.33 weeks/month x 6 months = $155,880\nAI Advancements agrees this is the total project costing for the 6 months of work at 4 days per week."
        },
        "AIA063 Endeavour Homes Automation": {
            "PROPOSAL": "Endeavour Homes Automation\n\nPROJECT TITLE\tEndeavour Homes Automation\nCOMPANY NAME\tEndeavour Homes\nCLIENT\tDom Morolla\nPROJECT MANAGER\tSean Oldenburger\nAUTHOR\tSean Oldenburger\nSTART DATE\t14th April 2025\nMINIMUM DURATION\t1 month\nPROJECT DESCRIPTION\tCreate an agent system to automate creating a Preliminary Quotation Summary using the building draft, Business Craft software information, and other necessary data.\n\n1.0 Scope\nThis proposal is a contractual agreement between AI Advancements (the consultant) and Endeavour Homes (the client) on the type of work to be performed, cost, and work structure of this project.\nThe main goal of this project is to develop an automation that takes an Endeavour Home building draft, Business Craft data, as well as any other necessary inputs to create a Preliminary Quotation Summary with a building estimation price that is to be sent to the client.\nThe exact methodology and feasibility of the projects goal are yet to be determined but rather is part of the project. The initial scope of work will be a feasibility study to review the current system, how it works, what is the process flow, what data can we access, and is the data in a good format. If the outcome of this feasibility study is successful, we will develop the agent system that will automate the creation of this report through to testing, iterating, improving, and educating the team on how to use the software created.\nOnce the system is in place, AI Advancements can provide ongoing support and maintenance under a separate agreement to be defined later.\nAs part of this project, AI Advancements will work with one of Endeavour Homes employees, Dean, who will sit with us at a minimum of 1 day per week for the initial feasibility study. Dean can sit with us in our office or work with us remotely on any days we are working on this project. He will help us initially in the feasibility study with understanding the systems, processes, and data and further in testing and providing feedback to improve the system when created.\n\n2.0 Contract Structure\nProject Structure\nThis project will operate on a time and materials basis.\nAI Advancements will reserve the capacity to work for the minimum number of days as outlined in Section 4. AI Advancements will aim to complete as much as possible per week, up to a maximum of 5 days, given AI Advancements has the available capacity to deliver the project as quickly as possible.\nEndeavour Homes has the ultimate discretion over the amount of work to be completed beyond the minimum duration outlined in Section 4.\nThere is no set end date to this project. AI Advancements will work on this project as long as Endeavour Homes deems necessary with the goal of completing the project as quick as possible.\nEither party may end the contract with 1 month's written notice.\nAI Advancements will provide fortnightly updates to Endeavour Homes to ensure openness and transparency of the work completed and allowing for adjustment and feedback to align the project to Endeavour Homes' goals.\nEndeavour Homes ultimately decides the work AI Advancements will complete throughout this project, with the advice from AI Advancements on the best course of action.\n\nIP\nEndeavour Homes IP maintains their IP, including all data, documentation and processes.\nIP created by AI Advancements stays with them.\nAI Advancements agrees to give Endeavour Homes 6 months of exclusivity on the technology and IP developed for this project, during which time AI Advancements will not use or offer this technology and IP to any other organisations.\n\nTeam\nAI Advancements core team is responsible and in charge of all work completed and will ensure everything completed is up to their standards.\nAI Advancements retains the right to subcontract or hire for parts of the project if required. AI Advancements promises to be transparent with this process and negotiate with Endeavour Homes in good faith.\n\nPricing\nEndeavour Homes agrees to pay AI Advancements for all work completed at a day rate of $1,600.\nAI Advancements will invoice Endeavour Homes for the work completed at the end of each calendar month. Invoices are due within 14 days of being issued.\n\n3.0 AI Advancements Team\nSean Oldenburger\tSean is a leading expert in computer vision and language models, honed through years of groundbreaking research and real-world applications in the mining sector. With a degree in Applied Mathematics and AI research throughout his studies, Sean excels at dealing with state-of-the-art AI models and staying on top of the everchanging AI landscape.\n\nSamuel Cunningham\tSamuel specialises in building full-stack applications utilising large language models and computer vision for a variety of businesses around Perth. Samuel completed a computer science degree at Curtin University, where he received multiple vice chancellors awards for academic excellence and met his cofounder Sean, when working in the Curtin AI research group\n\n4.0 Availability\nTime Period\tMinimum Weekly Capacity (days)\n14th April – 2nd May\t1\n5th May – 30th May\t2\n2nd June +\t3"
        }
    }
}

